{
    "languages": [
        {
            "id": 1,
            "name": "PHP",
            "rating": "7",
            "description": "The main language I use within my job - I have gone from knowing nothing about PHP, to feeling very confident in it."
        },
        {
            "id": 2,
            "name": "React",
            "rating": "6",
            "description": "The language the website has been built in! I've taken multiple online courses in React and am learning all of the time!"
        },
        {
            "id": 3,
            "name": "SQL",
            "rating": "7",
            "description": "This is another language used often within my job. Although it's usually wrapped in CodeIgniter syntax, I have become familiar with standard SQL when querying databases."
        },
        {
            "id": 4,
            "name": "JavaScript",
            "rating": "6.5",
            "description": "A language that I'm slowly coming to terms with - often I use jQuery instead of pure Javascript (or a combination of the two)."
        },
        {
            "id": 5,
            "name": "MATLAB",
            "rating": "8",
            "description": "The language used for my Dissertation! MATLAB was my go-to programming language of choice during my years studying Mathematics at university."
        },
        {
            "id": 6,
            "name": "C++",
            "rating": "5.5",
            "description": "A language I studied during university, C++ introduced me to object based programming."
        },
        {
            "id": 7,
            "name": "C#",
            "rating": "4.5",
            "description": "I self-taught C# by redoing university assignments in this language, but have not looked at it very much recently."
        },
        {
            "id": 8,
            "name": "Python",
            "rating": "4",
            "description": "A language I've never formally 'learnt', whenever I have come across Python I have more-or-less followed along and is one I have in my sights to learn more about!"
        }
    ],
    "additional": [
        {
            "id": 1,
            "name": "GitHub",
            "rating": "8.5",
            "description": "Used briefly during my dissertation, I now use GitHub on a daily basis during my role as a Junior Software Developer."
        },
        {
            "id": 2,
            "name": "jQuery",
            "rating": "6",
            "description": "Arguable the syntax I had the most trouble understanding initially, I now am confident in jQuery and much prefer it to regular JavaScript."
        },
        {
            "id": 3,
            "name": "CodeIgniter",
            "rating": "7",
            "description": "The Framework I work on in my job, I have developed an understanding of the framework and will continue to do so as I work closely with it."
        },
        {
            "id": 4,
            "name": "Laravel",
            "rating": "3",
            "description": "A Framework I'm very interested in learning, so I have started an online course in the latest version."
        }
    ]
}